.config/emacs/emacs.org
#+TITLE: Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :mkdirp yes :results silent

* early-init.el
:PROPERTIES:
:header-args:emacs-lisp: :tangle early-init.el
:END:

#+BEGIN_SRC emacs-lisp
  ;;; early-init.el --- Early initialization -*- lexical-binding: t; -*-

  ;;; Startup -------------------------------------------------------------------

  ;; Don't let package.el initialize itself. Elpaca handles packages.
  (setq package-enable-at-startup nil)

  ;; Speed up startup by delaying GC.
  (setq gc-cons-threshold most-positive-fixnum)
  (setq gc-cons-percentage 0.6)

  ;; Restore sane GC values once Emacs has started.
  (add-hook
   'emacs-startup-hook
   (lambda ()
     (setq gc-cons-threshold (* 64 1024 1024)
           gc-cons-percentage 0.1)))

  ;;; Native compilation --------------------------------------------------------

  (setq native-comp-async-report-warnings-errors nil)

  ;;; Environment ---------------------------------------------------------------

  ;; Faster plist decoding for LSP servers.
  (setenv "LSP_USE_PLISTS" "true")

  ;;; UI ------------------------------------------------------------------------

  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)

  (setq inhibit-startup-screen t)
  (setq inhibit-startup-message t)
  (setq inhibit-startup-echo-area-message user-login-name)

  (setq ring-bell-function #'ignore)

  (add-to-list 'default-frame-alist
             '(internal-border-width . 14))

  ;; Avoid expensive frame resizing during startup.
  (setq frame-inhibit-implied-resize t)

  ;; Don't initialize package.el.
  (setq package-quickstart nil)

  (provide 'early-init)
#+END_SRC

* init.el
:PROPERTIES:
:header-args:emacs-lisp: :tangle init.el
:END:

#+BEGIN_SRC emacs-lisp
  ;;; init.el --- Main entry point -*- lexical-binding: t; -*-

  ;; Add our modules directory to the load path.
  (add-to-list
   'load-path
   (expand-file-name "lisp" user-emacs-directory))

  ;; Load configuration modules in dependency order.
  (dolist (module
           '(bootstrap
             core
  		   prog
             orgconf
  		   ))
    (require module))

  ;; Optional machine-specific configuration.
  (let ((local (expand-file-name "lisp/local.el"
                                 user-emacs-directory)))
    (when (file-exists-p local)
      (load local nil t)))

  (provide 'init)

  ;;; init.el ends here
#+END_SRC

* bootstrap.el
:PROPERTIES:
:header-args:emacs-lisp: :tangle lisp/bootstrap.el
:END:

#+begin_src emacs-lisp
  ;;; bootstrap.el --- Bootstrap -*- lexical-binding: t; -*-
  (defvar elpaca-installer-version 0.12)
  (defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
  (defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
  (defvar elpaca-sources-directory (expand-file-name "sources/" elpaca-directory))
  (defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                                :ref nil :depth 1 :inherit ignore
                                :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                                :build (:not elpaca-activate)))
  (let* ((repo  (expand-file-name "elpaca/" elpaca-sources-directory))
         (build (expand-file-name "elpaca/" elpaca-builds-directory))
         (order (cdr elpaca-order))
         (default-directory repo))
    (add-to-list 'load-path (if (file-exists-p build) build repo))
    (unless (file-exists-p repo)
      (make-directory repo t)
      (when (<= emacs-major-version 28) (require 'subr-x))
      (condition-case-unless-debug err
          (if-let* ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                    ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                    ,@(when-let* ((depth (plist-get order :depth)))
                                                        (list (format "--depth=%d" depth) "--no-single-branch"))
                                                    ,(plist-get order :repo) ,repo))))
                    ((zerop (call-process "git" nil buffer t "checkout"
                                          (or (plist-get order :ref) "--"))))
                    (emacs (concat invocation-directory invocation-name))
                    ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                          "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                    ((require 'elpaca))
                    ((elpaca-generate-autoloads "elpaca" repo)))
              (progn (message "%s" (buffer-string)) (kill-buffer buffer))
            (error "%s" (with-current-buffer buffer (buffer-string))))
        ((error) (warn "%s" err) (delete-directory repo 'recursive))))
    (unless (require 'elpaca-autoloads nil t)
      (require 'elpaca)
      (elpaca-generate-autoloads "elpaca" repo)
      (let ((load-source-file-function nil)) (load "./elpaca-autoloads"))))
  (add-hook 'after-init-hook #'elpaca-process-queues)
  (elpaca `(,@elpaca-order))

  ;; Install use-package support
  (elpaca elpaca-use-package
    ;; Enable :elpaca use-package keyword.
    (elpaca-use-package-mode)
    ;; Assume :elpaca t unless otherwise specified.
    (setq use-package-always-ensure t))

  ;; Block until current queue processed.
  ;; (elpaca-wait)
  (setq use-package-compute-statistics t)

  (advice-add
   'elpaca--activate-package
   :around
   (lambda (orig pkg &rest args)
     (let ((t0 (current-time)))
       (prog1
           (apply orig pkg args)
         (message "%-25s %.3f"
                  (symbol-name pkg)
                  (float-time
                   (time-subtract (current-time) t0)))))))

  (add-hook
   'emacs-startup-hook
   (lambda ()
     (message
      "Emacs ready in %s s with %d GCs."
      (format "%.3f"
              (float-time
               (time-subtract after-init-time before-init-time)))
      gcs-done)))
  (add-hook
   'elpaca-after-init-hook
   (lambda ()
     (message
      "Elpaca finished in %.3f s"
      (float-time
       (time-subtract (current-time) before-init-time)))))

  (add-hook
   'window-setup-hook
   (lambda ()
     (message
      "Window setup finished in %.3f s"
      (float-time
       (time-subtract (current-time) before-init-time)))))
  ;; (use-package benchmark-init
  ;;   :ensure t
  ;;   :config
  ;;   ;; To disable collection of benchmark data after init is done.
  ;;   (add-hook 'after-init-hook 'benchmark-init/deactivate))

  (setq custom-file (expand-file-name "customs.el" user-emacs-directory))
  (add-hook 'elpaca-after-init-hook (lambda () (load custom-file 'noerror)))
#+END_SRC
** end
#+begin_src emacs-lisp
  (provide 'bootstrap)
#+end_src

* core.el
:PROPERTIES:
:header-args:emacs-lisp: :tangle lisp/core.el
:END:
#+begin_src emacs-lisp
  ;;; core.el --- Core -*- lexical-binding: t; -*-
  (eval-when-compile (require 'bootstrap))
#+end_src
** Saner Defaults

#+BEGIN_SRC emacs-lisp
  (set-default-coding-systems 'utf-8)
  (prefer-coding-system       'utf-8)
  (set-terminal-coding-system 'utf-8)

  (global-display-line-numbers-mode)
  (setq-default display-line-numbers-type 'relative)
  (setq-default display-line-numbers-width 3)

  (setq default-directory "~/")
  (save-place-mode 1)
  (electric-pair-mode 1)

  (add-hook 'Man-mode-hook (lambda() (display-line-numbers-mode 0)))

  (setq-default tab-width 4)

  (setq-default truncate-lines t)
  (blink-cursor-mode 0)

  (setq frame-resize-pixelwise t)

  (setq dired-kill-when-opening-new-dired-buffer t)
  (setq dired-listing-switches "-alh")


  (defun my/transparency (value)
    "Sets the transparency of the frame window. 0=transparent/100=opaque"
    (interactive "nTransparency Value 0 - 100 opaque: ")
    (set-frame-parameter (selected-frame) 'alpha-background value))

  ;; (mk/transparency 95)

  ;; (add-hook 'server-after-make-frame-hook (lambda () (mk/transparency 97)))

  (defun my/set-line-spacing (value)
    "Sets the line spacing"
    (interactive "nValue: ")
    (setq-default line-spacing value))

#+END_SRC

** Fonts

#+begin_src emacs-lisp
  (set-face-attribute 'default nil :family "CommitMono Nerd Font" :height 130)
  (set-face-attribute 'fixed-pitch nil :family "CommitMono Nerd Font" :height 130)
  (setq nerd-icons-font-family "CommitMono Nerd Font")
  (set-face-attribute 'variable-pitch nil :family "Inter" :height 170)
#+end_src

