.config/emacs/lisp/core.el
;;; core.el --- Core -*- lexical-binding: t; -*-
(eval-when-compile (require 'bootstrap))

(set-default-coding-systems 'utf-8)
(prefer-coding-system       'utf-8)
(set-terminal-coding-system 'utf-8)

(global-display-line-numbers-mode)
(setq-default display-line-numbers-type 'relative)
(setq-default display-line-numbers-width 3)

(setq default-directory "~/")
(save-place-mode 1)
(electric-pair-mode 1)

(add-hook 'Man-mode-hook (lambda() (display-line-numbers-mode 0)))

(setq-default tab-width 4)

(setq-default truncate-lines t)
(blink-cursor-mode 0)

(setq frame-resize-pixelwise t)

(setq dired-kill-when-opening-new-dired-buffer t)
(setq dired-listing-switches "-alh")


(defun my/transparency (value)
  "Sets the transparency of the frame window. 0=transparent/100=opaque"
  (interactive "nTransparency Value 0 - 100 opaque: ")
  (set-frame-parameter (selected-frame) 'alpha-background value))

;; (mk/transparency 95)

;; (add-hook 'server-after-make-frame-hook (lambda () (mk/transparency 97)))

(defun my/set-line-spacing (value)
  "Sets the line spacing"
  (interactive "nValue: ")
  (setq-default line-spacing value))


(set-face-attribute 'default nil :family "CommitMono Nerd Font" :height 130)
(set-face-attribute 'fixed-pitch nil :family "CommitMono Nerd Font" :height 130)
(setq nerd-icons-font-family "CommitMono Nerd Font")
(set-face-attribute 'variable-pitch nil :family "Inter" :height 170)
