.config/emacs/emacs.org
** Scrolling

#+begin_src emacs-lisp
  ;; (setq scroll-margin 4)
  (setq scroll-conservatively 101)
  (setq mouse-wheel-progressive-speed nil)
  (setq mouse-wheel-scroll-amount '(3 ((shift) . 1) ((control) . 6)))

  (use-package ultra-scroll
    :ensure `(ultra-scroll
  			:host github 
  			:repo "jdtsmith/ultra-scroll")
    :config
    (ultra-scroll-mode 1))

  (use-package transient
    :commands (my-scrolling-zone)
    :config
    (transient-define-prefix my-scrolling-zone ()
  	"A modifier-free zone triggered by SPC v using h j k l for viewport scrolling."
  	[:description "Viewport Navigation"
  				  ["Full Page"
  				   ("l" "Page Down" scroll-up-command :transient t)
  				   ("h" "Page Up"   scroll-down-command :transient t)]
  				  ["Half Page"
  				   ("j" "Half Page Down" (lambda () (interactive) (scroll-up (/ (window-body-height) 2))) :transient t)
  				   ("k" "Half Page Up"   (lambda () (interactive) (scroll-down (/ (window-body-height) 2))) :transient t)]
  				  ["Recenter"
  				   ("c" "Center View" recenter-top-bottom :transient t)]
  				  ["Quit"
  				   ("<escape>" "Exit Zone" transient-quit-one)]]))
#+end_src

** Icons

#+begin_src emacs-lisp
  ;; (use-package all-the-icons :defer t)

  ;; (use-package all-the-icons-dired
  ;;   :hook (dired-mode . all-the-icons-dired-mode))
  (use-package nerd-icons-completion
    :after marginalia
    :config
    (nerd-icons-completion-mode)
    (add-hook 'marginalia-mode-hook #'nerd-icons-completion-marginalia-setup))

  (use-package nerd-icons)

  (use-package nerd-icons-corfu
    :after (corfu nerd-icons)
    :config
    ; This is directly from the package. needed more space after the icon
    (defun my/nerd-icons-corfu-formatter (_)
    (and-let* ((kindfunc (plist-get completion-extra-properties :company-kind)))
      (lambda (cand)
        (let* ((kind (funcall kindfunc cand))
               (glyph (nerd-icons-corfu--get-by-kind kind cand)))
          (concat
           (and (display-graphic-p) (propertize " " 'display '(space :width 0.5)))
           glyph
           (propertize " " 'display '(space :width 1.0)))))))
    ;; (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter)
    (add-to-list 'corfu-margin-formatters #'my/nerd-icons-corfu-formatter))
#+end_src

** Dashboard

#+begin_src emacs-lisp
  (use-package dashboard
    :init
    ;; (setq dashboard-icon-type 'all-the-icons)
    ;; (setq dashboard-startup-banner "~/.config/emacs/cat.webp")
    (setq dashboard-startup-banner 'logo-braille)
    (setq dashboard-items '((recents  . 5)
                            (projects . 5)))
    (setq dashboard-vertically-center-content t)
    (setq dashboard-center-content t)
    (setq dashboard-set-heading-icons t)
    (setq dashboard-set-file-icons t)
    (setq dashboard-projects-backend 'project-el)
    (setq initial-buffer-choice 'dashboard-open)
    :config
    (add-hook 'elpaca-after-init-hook #'dashboard-insert-startupify-lists)
    (add-hook 'elpaca-after-init-hook #'dashboard-initialize)
    (dashboard-setup-startup-hook))
#+end_src

** Modeline

#+begin_src emacs-lisp
  (column-number-mode)
  (setq-default mode-line-percent-position nil)
#+end_src

** Theming

#+begin_src emacs-lisp
    ;;; Themes

  (setq custom-safe-themes t)

  (add-to-list
   'custom-theme-load-path
   (expand-file-name "themes" user-emacs-directory))

  (use-package doom-themes
    :defer t
    :custom
    (doom-themes-enable-bold nil)
    (doom-themes-enable-italic nil))

  (use-package kaolin-themes
    :defer t)

  (use-package uwu-theme
    :defer t
    :custom
    (uwu-distinct-line-numbers nil))

  (use-package base16-theme
    :defer t
    :custom
    (base16-distinct-fringe-background nil))

  (use-package ef-themes
    :defer t)

  (use-package apropospriate-theme
    :defer t)

  (use-package kanagawa-themes
    :defer t)

  (use-package nordic-night-theme
    :defer t)


  ;;; Theme helpers

  (defvar my/saved-bg nil
    "Stores the original background of the `default' face.")

  (defvar my/bg-is-black nil
    "Non-nil when the background is currently forced to pure black.")

  (defun my/toggle-black-background ()
    "Toggle the default face background between pure black and the theme background."
    (interactive)
    (if my/bg-is-black
        (progn
          (set-face-attribute 'default nil :background my/saved-bg)
          (setq my/bg-is-black nil))
      (setq my/saved-bg (face-attribute 'default :background))
      (set-face-attribute 'default nil :background "#000000")
      (setq my/bg-is-black t)))

  ;; Reset the toggle whenever a new theme is loaded.
  (add-hook
   'after-load-theme-hook
   (lambda ()
     (setq my/bg-is-black nil)))

  (global-set-key
   (kbd "C-c b")
   #'my/toggle-black-background)
#+end_src

** COMMENT Evil

#+begin_src emacs-lisp
  (use-package evil
    :init
    (setq evil-want-keybinding nil
          evil-want-C-u-scroll t
          evil-want-Y-yank-to-eol t
          ;; evil-move-beyond-eol t
          evil-move-cursor-back nil
          evil-undo-system 'undo-redo
          evil-insert-state-cursor 'box
          evil-visual-state-cursor 'hollow
          evil-respect-visual-line-mode t
          evil-want-minibuffer t
          evil-mode-line-format nil

          evil-normal-state-tag   (propertize " ⏺ " 'face '((:foreground "MediumTurquoise")))
          evil-emacs-state-tag    (propertize " ⏺ " 'face '((:foreground "BlueViolet")))
          evil-insert-state-tag   (propertize " ⏺ " 'face '((:foreground "Orchid")))
          evil-replace-state-tag  (propertize " ⏺ " 'face '((:foreground "Red3")))
          evil-motion-state-tag   (propertize " ⏺ " 'face '((:foreground "OrangeRed3")))
          evil-visual-state-tag   (propertize " ⏺ " 'face '((:foreground "Gold2")))
          evil-operator-state-tag (propertize " ⏺ " 'face '((:foreground "RoyalBlue"))))
    :config
    (evil-mode 1)
    (evil-global-set-key 'normal (kbd "U") 'evil-redo)
    (evil-set-initial-state 'minibuffer-mode 'insert))

  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init))

  (use-package evil-snipe
    :config
    (evil-snipe-mode)
    (evil-snipe-override-mode))

  (use-package evil-commentary
    :config
    (evil-commentary-mode))
#+end_src

