.config/emacs/lisp/core.el

;; (setq scroll-margin 4)
(setq scroll-conservatively 101)
(setq mouse-wheel-progressive-speed nil)
(setq mouse-wheel-scroll-amount '(3 ((shift) . 1) ((control) . 6)))

(use-package ultra-scroll
  :ensure `(ultra-scroll
			:host github 
			:repo "jdtsmith/ultra-scroll")
  :config
  (ultra-scroll-mode 1))

(use-package transient
  :commands (my-scrolling-zone)
  :config
  (transient-define-prefix my-scrolling-zone ()
	"A modifier-free zone triggered by SPC v using h j k l for viewport scrolling."
	[:description "Viewport Navigation"
				  ["Full Page"
				   ("l" "Page Down" scroll-up-command :transient t)
				   ("h" "Page Up"   scroll-down-command :transient t)]
				  ["Half Page"
				   ("j" "Half Page Down" (lambda () (interactive) (scroll-up (/ (window-body-height) 2))) :transient t)
				   ("k" "Half Page Up"   (lambda () (interactive) (scroll-down (/ (window-body-height) 2))) :transient t)]
				  ["Recenter"
				   ("c" "Center View" recenter-top-bottom :transient t)]
				  ["Quit"
				   ("<escape>" "Exit Zone" transient-quit-one)]]))

;; (use-package all-the-icons :defer t)

;; (use-package all-the-icons-dired
;;   :hook (dired-mode . all-the-icons-dired-mode))
(use-package nerd-icons-completion
  :after marginalia
  :config
  (nerd-icons-completion-mode)
  (add-hook 'marginalia-mode-hook #'nerd-icons-completion-marginalia-setup))

(use-package nerd-icons)

(use-package nerd-icons-corfu
  :after (corfu nerd-icons)
  :config
  ; This is directly from the package. needed more space after the icon
  (defun my/nerd-icons-corfu-formatter (_)
  (and-let* ((kindfunc (plist-get completion-extra-properties :company-kind)))
    (lambda (cand)
      (let* ((kind (funcall kindfunc cand))
             (glyph (nerd-icons-corfu--get-by-kind kind cand)))
        (concat
         (and (display-graphic-p) (propertize " " 'display '(space :width 0.5)))
         glyph
         (propertize " " 'display '(space :width 1.0)))))))
  ;; (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter)
  (add-to-list 'corfu-margin-formatters #'my/nerd-icons-corfu-formatter))

(use-package dashboard
  :init
  ;; (setq dashboard-icon-type 'all-the-icons)
  ;; (setq dashboard-startup-banner "~/.config/emacs/cat.webp")
  (setq dashboard-startup-banner 'logo-braille)
  (setq dashboard-items '((recents  . 5)
                          (projects . 5)))
  (setq dashboard-vertically-center-content t)
  (setq dashboard-center-content t)
  (setq dashboard-set-heading-icons t)
  (setq dashboard-set-file-icons t)
  (setq dashboard-projects-backend 'project-el)
  (setq initial-buffer-choice 'dashboard-open)
  :config
  (add-hook 'elpaca-after-init-hook #'dashboard-insert-startupify-lists)
  (add-hook 'elpaca-after-init-hook #'dashboard-initialize)
  (dashboard-setup-startup-hook))

(column-number-mode)
(setq-default mode-line-percent-position nil)

  ;;; Themes

(setq custom-safe-themes t)

(add-to-list
 'custom-theme-load-path
 (expand-file-name "themes" user-emacs-directory))

(use-package doom-themes
  :defer t
  :custom
  (doom-themes-enable-bold nil)
  (doom-themes-enable-italic nil))

(use-package kaolin-themes
  :defer t)

(use-package uwu-theme
  :defer t
  :custom
  (uwu-distinct-line-numbers nil))

(use-package base16-theme
  :defer t
  :custom
  (base16-distinct-fringe-background nil))

(use-package ef-themes
  :defer t)

(use-package apropospriate-theme
  :defer t)

(use-package kanagawa-themes
  :defer t)

(use-package nordic-night-theme
  :defer t)


;;; Theme helpers

(defvar my/saved-bg nil
  "Stores the original background of the `default' face.")

(defvar my/bg-is-black nil
  "Non-nil when the background is currently forced to pure black.")

(defun my/toggle-black-background ()
  "Toggle the default face background between pure black and the theme background."
  (interactive)
  (if my/bg-is-black
      (progn
        (set-face-attribute 'default nil :background my/saved-bg)
        (setq my/bg-is-black nil))
    (setq my/saved-bg (face-attribute 'default :background))
    (set-face-attribute 'default nil :background "#000000")
    (setq my/bg-is-black t)))

;; Reset the toggle whenever a new theme is loaded.
(add-hook
 'after-load-theme-hook
 (lambda ()
   (setq my/bg-is-black nil)))

(global-set-key
 (kbd "C-c b")
 #'my/toggle-black-background)
