.config/emacs/lisp/core.el

(use-package meow
  :config
  (defun my/meow-toggle-state ()
  (interactive)
  (if (meow-normal-mode-p)
      (meow-motion-mode)
    (meow-normal-mode)))
  
  ;; (setq meow-mode-state-list
  ;;     '((conf-mode . normal)
  ;;       (fundamental-mode . normal)
  ;;       (help-mode . normal)
  ;;       (prog-mode . normal)
  ;;       (text-mode . normal)
  ;; 		(special-mode . normal)))
  (defun meow-setup ()
    (setq meow-cheatsheet-layout meow-cheatsheet-layout-qwerty)
    (meow-motion-overwrite-define-key
	 '("h" . meow-left)
     '("j" . meow-next)
     '("k" . meow-prev)
	 '("l" . meow-right)
	 '("F" . flash-jump)
     '("<escape>" . ignore))
    (meow-leader-define-key
     ;; SPC j/k will run the original command in MOTION state.
     '("j" . "H-j")
     '("k" . "H-k")
     ;; Use SPC (0-9) for digit arguments.
     '("1" . meow-digit-argument)
     '("2" . meow-digit-argument)
     '("3" . meow-digit-argument)
     '("4" . meow-digit-argument)
     '("5" . meow-digit-argument)
     '("6" . meow-digit-argument)
     '("7" . meow-digit-argument)
     '("8" . meow-digit-argument)
     '("9" . meow-digit-argument)
     '("0" . meow-digit-argument)
     '("/" . meow-keypad-describe-key)
     '("?" . meow-cheatsheet)

	 '("SPC" . execute-extended-command)
	 
	 '("v" . my-scrolling-zone)

	 '("f f" . find-file)
	 '("f s" . save-buffer)
	 '("f r" . rename-visited-file)

	 '("b"   . consult-buffer)
	 '("'"   . consult-bookmark)
	 '("k"   . kill-current-buffer) 

	 '("s"   . consult-line)

	 '("w"   . ace-window)
	 '("o"   . other-window)
	 '("0"   . delete-window)

	 ;; '("h v" . helpful-variable)
	 ;; '("h f" . helpful-function)
	 ;; '("h k" . helpful-key)
	 ;; '("h o" . helpful-symbol)
	 ;; '("h p" . helpful-at-point)
	 ;; '("h F" . describe-face)

	 '("p p" . project-switch-project)
	 '("p f" . project-find-file)
	 '("p b" . consult-project-buffer)
	 '("t b" . my/toggle-black-background)
	 '("t m" . my/meow-toggle-state))
	
    (meow-normal-define-key
     '("0" . meow-expand-0)
     '("9" . meow-expand-9)
     '("8" . meow-expand-8)
     '("7" . meow-expand-7)
     '("6" . meow-expand-6)
     '("5" . meow-expand-5)
     '("4" . meow-expand-4)
     '("3" . meow-expand-3)
     '("2" . meow-expand-2)
     '("1" . meow-expand-1)
     '("-" . negative-argument)
     '(";" . meow-reverse)
     '("," . meow-inner-of-thing)
     '("." . meow-bounds-of-thing)
     '("[" . meow-beginning-of-thing)
     '("]" . meow-end-of-thing)
     '("a" . meow-append)
     '("A" . meow-open-below)
     '("b" . meow-back-word)
     '("B" . meow-back-symbol)
     '("c" . meow-change)
     '("d" . meow-delete)
     '("D" . meow-backward-delete)
     '("e" . meow-next-word)
     '("E" . meow-next-symbol)
     '("f" . meow-find)
     '("g" . meow-cancel-selection)
     '("G" . meow-grab)
     '("h" . meow-left)
     '("H" . meow-left-expand)
     '("i" . meow-insert)
     '("I" . meow-open-above)
     '("j" . meow-next)
     '("J" . meow-next-expand)
     '("k" . meow-prev)
     '("K" . meow-prev-expand)
     '("l" . meow-right)
     '("L" . meow-right-expand)
     '("m" . meow-join)
     '("n" . meow-search)
     '("o" . meow-block)
     '("O" . meow-to-block)
     '("p" . meow-yank)
     '("q" . meow-quit)
     '("Q" . meow-goto-line)
     '("r" . meow-replace)
     '("R" . meow-swap-grab)
     '("s" . meow-kill)
     '("t" . meow-till)
     '("u" . meow-undo)
     '("U" . meow-undo-in-selection)
     '("v" . meow-visit)
     '("w" . meow-mark-word)
     '("W" . meow-mark-symbol)
     '("x" . meow-line)
     '("X" . meow-goto-line)
     '("y" . meow-save)
     '("Y" . meow-sync-grab)
     '("z" . meow-pop-selection)
     '("'" . repeat)
     '("<escape>" . ignore)
	 
	 '("F" . flash-jump)))

  (keymap-set meow-insert-state-keymap
            "C-SPC"
            #'my/corfu-refresh)
  
  (meow-setup)
  (meow-global-mode 1))

(use-package project)

(use-package vertico
  :init
  (vertico-mode)
  (setq vertico-count 10)
  (setq evil-complete-next-minibuffer-func 'vertico-next
        evil-complete-previous-minibuffer-func 'vertico-previous))

;; (use-package orderless
;;   :config
;;   (setq completion-styles '(orderless basic)
;;         completion-category-defaults nil
;;         completion-category-overrides '((file (styles . (partial-completion)))))

;;   (set-face-attribute 'orderless-match-face-0 nil :weight 'normal)
;;   (set-face-attribute 'orderless-match-face-1 nil :weight 'normal)
;;   (set-face-attribute 'orderless-match-face-2 nil :weight 'normal)
;;   (set-face-attribute 'orderless-match-face-3 nil :weight 'normal))


;; (use-package orderless
;;   :ensure t
;;   :custom
;;   ;; 🔴 IMPORTANT: basic first → fixes CAPF replacement issues
;;   (completion-styles '(basic orderless))

;;   ;; Disable default overrides
;;   (completion-category-defaults nil)

;;   ;; Per-category behavior
;;   (completion-category-overrides
;;    '((file (styles partial-completion))   ;; better file path completion
;;      (eglot (styles basic orderless))))  ;; 🔴 critical for LSP/CAPF

;;   :config
;;   ;; Optional: make matches less visually noisy
;;   (set-face-attribute 'orderless-match-face-0 nil :weight 'normal)
;;   (set-face-attribute 'orderless-match-face-1 nil :weight 'normal)
;;   (set-face-attribute 'orderless-match-face-2 nil :weight 'normal)
;;   (set-face-attribute 'orderless-match-face-3 nil :weight 'normal))

(use-package fzf-native)
(use-package fussy
  :config
  (fussy-setup)
  (fussy-setup-fzf)
  (fussy-eglot-setup)
  (fussy-corfu-setup)
  (defun fussy-try-completions (string table pred point)
	(let ((res (completion-flex-try-completion
				string table pred point)))
      (if (consp res)
          (cons string (length string))
		res))))

(use-package marginalia
  :init
  (marginalia-mode))

(use-package consult
  :init
