.config/emacs/emacs.org
*** Consult

#+begin_src emacs-lisp
  (use-package consult
    :init

    ;; Optionally configure the register formatting. This improves the register
    ;; preview for `consult-register', `consult-register-load',
    ;; `consult-register-store' and the Emacs built-ins.
    (setq register-preview-delay 0.5
          register-preview-function #'consult-register-format)

    ;; Optionally tweak the register preview window.
    ;; This adds thin lines, sorting and hides the mode line of the window.
    (advice-add #'register-preview :override #'consult-register-window)

    ;; Use Consult to select xref locations with preview
    (setq xref-show-xrefs-function #'consult-xref
          xref-show-definitions-function #'consult-xref)

    ;; Configure other variables and modes in the :config section,
    ;; after lazily loading the package.
    :config

    ;; Optionally configure preview. The default value
    ;; is 'any, such that any key triggers the preview.
    ;; (setq consult-preview-key 'any)
    ;; (setq consult-preview-key (kbd "M-."))
    ;; (setq consult-preview-key (list (kbd "<S-down>") (kbd "<S-up>")))
    ;; For some commands and buffer sources it is useful to configure the
    ;; :preview-key on a per-command basis using the `consult-customize' macro.
    (consult-customize
     consult-theme :preview-key '(:debounce 0.2 any)
     consult-ripgrep consult-git-grep consult-grep consult-man
     consult-bookmark consult-recent-file consult-xref
     consult-source-bookmark consult-source-file-register
     consult-source-recent-file consult-source-project-recent-file)


    ;; (consult-customize
    ;;  consult-theme
    ;;  :preview-key '(:debounce 0.2 any)
    ;;  consult-ripgrep consult-git-grep consult-grep
    ;;  consult-bookmark consult-recent-file consult-xref
    ;;  consult--source-bookmark consult--source-recent-file
    ;;  consult--source-project-recent-file
    ;;  ;; :preview-key (kbd "M-.")
    ;;  :preview-key '(:debounce 0.4 any))

    ;; Optionally configure the narrowing key.
    ;; Both < and C-+ work reasonably well.
    (setq consult-narrow-key "<") ;; (kbd "C-+")

    ;; Optionally make narrowing help available in the minibuffer.
    ;; You may want to use `embark-prefix-help-command' or which-key instead.
    ;; (define-key consult-narrow-map (vconcat consult-narrow-key "?") #'consult-narrow-help)

    ;; By default `consult-project-function' uses `project-root' from project.el.
    ;; Optionally configure a different project root function.
    ;; There are multiple reasonable alternatives to chose from.
      ;;;; 1. project.el (the default)
    (setq consult-project-function #'consult--default-project-function)
      ;;;; 2. projectile.el (projectile-project-root)
    ;; (autoload 'projectile-project-root "projectile")
    ;; (setq consult-project-function (lambda (_) (projectile-project-root)))
      ;;;; 3. vc.el (vc-root-dir)
    ;; (setq consult-project-function (lambda (_) (vc-root-dir)))
      ;;;; 4. locate-dominating-file
    ;; (setq consult-project-function (lambda (_) (locate-dominating-file "." ".git")))
    )
#+end_src

** Ace Window
#+begin_src emacs-lisp
(use-package ace-window
  :commands ace-window
  :custom
  (aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
  (aw-dispatch-always t)
  (aw-ignore-on nil)
  :config
  (set-face-attribute 'aw-leading-char-face nil :height 1.0))
#+end_src

** Avy
#+begin_src emacs-lisp
(use-package avy
  :commands
  (avy-goto-char
   avy-goto-char-2
   avy-goto-word-1
   avy-goto-line))
#+end_src

** Flash
#+begin_src emacs-lisp
  (use-package flash
    :commands (flash-jump flash-jump-continue
               flash-treesitter)
    :custom
    (flash-multi-window t))
#+end_src

** Magit
#+begin_src emacs-lisp
(use-package magit
  :commands
  (magit
   magit-status
   magit-file-dispatch))
#+end_src

** COMMENT Treemacs
#+begin_src emacs-lisp
  (use-package treemacs
    :commands
    (treemacs
     treemacs-select-window
     treemacs-add-and-display-current-project-exclusively)
    :hook
    (treemacs-mode . (lambda ()
                       (display-line-numbers-mode 0)))
    :custom
    (treemacs-width-is-initially-locked nil)
    :config
    (treemacs-resize-icons 16)
    (treemacs-follow-mode 1)
    (treemacs-filewatch-mode 1)

    ;; (load "treemacs-theme.el")
    ;; (treemacs-load-theme 'mk/treemacs-theme)
    )

  (use-package treemacs-evil
    :after treemacs)
#+end_src

** Ripgrep
#+begin_src emacs-lisp
(use-package rg
  :commands
  (rg
   rg-project
   rg-menu))
#+end_src

** Helpful
#+begin_src emacs-lisp
(use-package helpful
  :bind
  (("C-h f" . helpful-function)
   ("C-h c" . helpful-callable)
   ("C-h v" . helpful-variable)
   ("C-h o" . helpful-symbol)
   ("C-h k" . helpful-key))
  :commands
  (helpful-function
   helpful-callable
   helpful-variable
   helpful-symbol
   helpful-key))
#+end_src

** Which Key
#+begin_src emacs-lisp
  (use-package which-key
    :defer t
    :config
    (which-key-mode))
#+end_src

** Rainbow Mode
#+begin_src emacs-lisp
(use-package rainbow-mode
  :commands rainbow-mode)
#+end_src
** Ediff
#+begin_src emacs-lisp
  (setq ediff-window-setup-function 'ediff-setup-windows-plain
        ediff-split-window-function 'split-window-horizontally)
#+end_src

** Restart Emacs
#+begin_src emacs-lisp
  (defun mk/launch-emacs-daemon-and-client ()
    (call-process "sh" nil nil nil "-c" "emacs --daemon && emacsclient -c &"))

  (defun mk/restart-emacs-daemon ()
    "Restart Emacs daemon and launch a new client."
    (interactive)
    (let ((kill-emacs-hook (append kill-emacs-hook (list 'mk/launch-emacs-daemon-and-client))))
      (save-buffers-kill-emacs)))

  (global-set-key (kbd "<f12>") 'mk/restart-emacs-daemon)
  (global-set-key (kbd "<f11>") 'save-buffers-kill-emacs)
#+end_src

** Editting
#+begin_src emacs-lisp
  (defun mk-indent-buffer ()
    "Indent the buffer"
    (interactive)
    (indent-region (point-min) (point-max)))

  (defun mk-divider (str len)
    "Insert a divider on the current line"
    (interactive "sEnter the string for the divider: \nnEnter the length for the divider: ")
    (dotimes (_ len)
      (insert str))
    (insert "  ")
    (dotimes (_ len)
      (insert str))
    (backward-char (1+ (* len (length str))))
    (evil-insert-state))
#+end_src
** end
#+begin_src emacs-lisp
  (provide 'core)
#+end_src

* prog.el
:PROPERTIES:
:header-args:emacs-lisp: :tangle lisp/prog.el
:END:
#+begin_src emacs-lisp
  ;;; prog.el --- Prog -*- lexical-binding: t; -*-
    (eval-when-compile (require 'bootstrap))

#+end_src


** Languages

*** C++
#+begin_src emacs-lisp
  (setq-default c-basic-offset 4)
  (setq-default c-default-style "bsd")

  ;; (add-to-list 'auto-mode-alist '("\\.h\\'" . c++-mode))
  ;; (add-to-list 'auto-mode-alist '("\\.cpp\\'" . c++-mode))
  ;; (add-to-list 'auto-mode-alist '("\\.inl\\'" . c++-mode))

  (setq c-ts-mode-indent-offset 4)
  (setq c-ts-mode-indent-style 'bsd)
#+end_src

*** Lua
#+begin_src emacs-lisp
(use-package lua-mode
  :mode "\\.lua\\'")
#+end_src

*** Rust
#+begin_src emacs-lisp
  ;; (use-package rust-ts-mode
  ;;   :mode "\\.rs\\'")
#+end_src

*** COMMENT CMake
#+begin_src emacs-lisp
(use-package cmake-font-lock
  :hook (cmake-mode . cmake-font-lock-activate))
#+end_src

*** GLSL
#+begin_src emacs-lisp
(use-package glsl-mode
  :mode ("\\.vert\\'"
         "\\.frag\\'"
         "\\.geom\\'"
         "\\.comp\\'"
         "\\.tesc\\'"
         "\\.tese\\'"
         "\\.glsl\\'"))
#+end_src

*** Emacs Lisp
#+begin_src emacs-lisp
(use-package rainbow-delimiters
  :hook (emacs-lisp-mode . rainbow-delimiters-mode))
#+end_src

*** YAML
#+begin_src emacs-lisp
(use-package yaml-mode
  :mode "\\.ya?ml\\'")
#+end_src

*** LaTeX
#+begin_src emacs-lisp
(use-package latex
  :ensure
  (auctex
   :pre-build
   (("./autogen.sh")
    ("./configure" "--without-texmf-dir")
    ("make")))
  :mode ("\\.tex\\'" . LaTeX-mode)
  :custom
  (TeX-auto-save t)
  (TeX-engine 'luatex)
  (TeX-parse-self t)
  (TeX-master nil))
#+end_src

*** Typst
#+begin_src emacs-lisp
(use-package typst-ts-mode
  :mode "\\.typ\\'")

(use-package typst-preview
  :after typst-ts-mode
  :custom
  (typst-preview-invert-colors "never"))
#+end_src

*** Kotlin
#+begin_src emacs-lisp
(use-package kotlin-ts-mode
  :mode "\\.kt\\'"
  :config
  (add-to-list
   'treesit-language-source-alist
   '(kotlin . ("https://github.com/fwcd/tree-sitter-kotlin"))))
#+end_src

*** Python
#+begin_src emacs-lisp
(use-package pyvenv
  :commands
  (pyvenv-activate
   pyvenv-workon
   pyvenv-deactivate))
#+end_src

*** KDL
#+begin_src emacs-lisp
(use-package kdl-ts-mode
  :ensure
  `(kdl-ts-mode
    :host github
    :repo "merrickluo/kdl-ts-mode")
  :mode "\\.kdl\\'"
  :config
  (add-to-list
   'treesit-language-source-alist
   '(kdl . ("https://github.com/tree-sitter-grammars/tree-sitter-kdl"))))
#+end_src

