.config/emacs/lisp/prog.el
;;; prog.el --- Prog -*- lexical-binding: t; -*-
  (eval-when-compile (require 'bootstrap))


(setq-default c-basic-offset 4)
(setq-default c-default-style "bsd")

;; (add-to-list 'auto-mode-alist '("\\.h\\'" . c++-mode))
;; (add-to-list 'auto-mode-alist '("\\.cpp\\'" . c++-mode))
;; (add-to-list 'auto-mode-alist '("\\.inl\\'" . c++-mode))

(setq c-ts-mode-indent-offset 4)
(setq c-ts-mode-indent-style 'bsd)

(use-package lua-mode
  :mode "\\.lua\\'")

;; (use-package rust-ts-mode
;;   :mode "\\.rs\\'")

(use-package glsl-mode
  :mode ("\\.vert\\'"
         "\\.frag\\'"
         "\\.geom\\'"
         "\\.comp\\'"
         "\\.tesc\\'"
         "\\.tese\\'"
         "\\.glsl\\'"))

(use-package rainbow-delimiters
  :hook (emacs-lisp-mode . rainbow-delimiters-mode))

(use-package yaml-mode
  :mode "\\.ya?ml\\'")

(use-package latex
  :ensure
  (auctex
   :pre-build
   (("./autogen.sh")
    ("./configure" "--without-texmf-dir")
    ("make")))
  :mode ("\\.tex\\'" . LaTeX-mode)
  :custom
  (TeX-auto-save t)
  (TeX-engine 'luatex)
  (TeX-parse-self t)
  (TeX-master nil))

(use-package typst-ts-mode
  :mode "\\.typ\\'")

(use-package typst-preview
  :after typst-ts-mode
  :custom
  (typst-preview-invert-colors "never"))

(use-package kotlin-ts-mode
  :mode "\\.kt\\'"
  :config
  (add-to-list
   'treesit-language-source-alist
   '(kotlin . ("https://github.com/fwcd/tree-sitter-kotlin"))))

(use-package pyvenv
  :commands
  (pyvenv-activate
   pyvenv-workon
   pyvenv-deactivate))

(use-package kdl-ts-mode
  :ensure
  `(kdl-ts-mode
    :host github
    :repo "merrickluo/kdl-ts-mode")
  :mode "\\.kdl\\'"
  :config
  (add-to-list
   'treesit-language-source-alist
   '(kdl . ("https://github.com/tree-sitter-grammars/tree-sitter-kdl"))))
