.config/emacs/emacs.org
** Corfu
#+begin_src emacs-lisp
(use-package corfu
  :custom
  (corfu-auto nil)
  (corfu-auto-prefix 1)
  (corfu-auto-delay 0.0)
  (corfu-preview-current nil)
  (corfu-on-exact-match nil)

  :init
  (global-corfu-mode)

  :bind
  (:map corfu-map
        ("<tab>" . corfu-insert))

  :config
  (defun my/corfu-refresh ()
    (interactive)
    (when (bound-and-true-p corfu--frame)
      (corfu-quit))
    (completion-at-point)))
#+end_src

** COMMENT Kind Icon
#+begin_src emacs-lisp
(use-package kind-icon
  :after corfu
  :custom
  (kind-icon-default-face 'corfu-default)
  (kind-icon-blend-background nil)

  :config
  (add-to-list
   'corfu-margin-formatters
   #'kind-icon-margin-formatter)

  (plist-put kind-icon-default-style
             :height 0.9))
#+end_src

** Cape
#+begin_src emacs-lisp
(use-package cape
  :init
  ;; Always request fresh completions from Eglot.
  (advice-add
   'eglot-completion-at-point
   :around
   #'cape-wrap-buster)

  ;; Additional completion source.
  (add-hook
   'completion-at-point-functions
   #'cape-file
   t))
#+end_src

** Nova
#+begin_src emacs-lisp
(use-package nova
  :ensure
  (:host github
   :repo "thisisran/nova")
  :defer t)
#+end_src


** Tree-sitter
#+begin_src emacs-lisp
  ;; (use-package treesit-auto
  ;;   :hook
  ;;   (after-init . global-treesit-auto-mode))

  ; apparently this is enough for emacs 31?
  (setq treesit-enabled-modes t)
 ;; (setq treesit-auto-install-grammar 'prompt)
#+end_src

** COMMENT Yasnippet
#+begin_src emacs-lisp
(use-package yasnippet
  :init
  (yas-global-mode)

  :bind
  (:map yas-keymap
        ("TAB" . nil)
        ("C-S-n" . yas-next-field)
        ("C-S-p" . yas-prev-field)))
#+end_src

** Eglot
#+begin_src emacs-lisp
  (use-package eglot
    :defer t

    :custom
    (eglot-send-changes-idle-time 0.0)
    (eglot-ignored-server-capabilities
     '(:documentOnTypeFormattingProvider
       :inlayHintProvider
       :documentHighlightProvider))

    ;; :hook
    ;; ((c-mode
    ;;   c++-mode
    ;;   c-ts-mode
    ;;   c++-ts-mode
    ;;   kotlin-ts-mode)
    ;;  . eglot-ensure)

    :config
    (add-to-list
     'eglot-server-programs
     '((c-mode c++-mode c-ts-mode c++-ts-mode)
       . ("clangd"
          "--completion-style=detailed"
          "--header-insertion=never"
          "--limit-results=0")))

    (add-to-list
     'eglot-server-programs
     '(kotlin-ts-mode . ("kotlin-language-server")))

    :bind
    (:map eglot-mode-map
          ("C-c e a" . eglot-code-actions)
          ("C-c e r" . eglot-rename)
          ("C-c e f" . eglot-format)

          ("C-c e d" . xref-find-definitions)
          ("C-c e i" . eglot-find-implementation)
          ("C-c e t" . eglot-find-typeDefinition)
          ("C-c e u" . xref-find-references)

          ("C-c e h" . eldoc)
          ("C-c e s" . consult-eglot-symbols)

          ("C-c e l" . eglot-list-connections)
          ("C-c e q" . eglot-shutdown)
          ("C-c e R" . eglot-reconnect)))
  (use-package consult-eglot
    :after eglot)
#+end_src

** Dape
#+begin_src emacs-lisp
  (use-package dape
    :ensure
    (:host github
     :repo "svaante/dape")

    :commands
    (dape
     dape-repl
     dape-breakpoint-toggle)

    :custom
    (dape-buffer-window-arrangement 'right)

    :config
    (dape-breakpoint-global-mode))
#+end_src
** end
#+begin_src emacs-lisp
  (provide 'prog)
#+end_src

* orgconf.el
:PROPERTIES:
:header-args:emacs-lisp: :tangle lisp/orgconf.el
:END:
#+begin_src emacs-lisp
  ;;; orgconf.el --- OrgConf -*- lexical-binding: t; -*-
    (eval-when-compile (require 'bootstrap))

#+end_src

** Mixed Pitch
#+begin_src emacs-lisp
(use-package mixed-pitch
  :custom
  (mixed-pitch-set-height t))
#+end_src

** Org
#+begin_src emacs-lisp
(use-package org
  :mode ("\\.org\\'" . org-mode)

  :custom
  (org-startup-indented t)
  (org-image-actual-width nil)
  (org-pretty-entities t)
  (org-preview-latex-default-process 'dvisvgm)

  :config
  (require 'org-tempo)
  (add-to-list
   'org-structure-template-alist
   '("el" . "src emacs-lisp"))

  (add-to-list
   'org-latex-packages-alist
   '("" "chemfig" t))

  (org-babel-do-load-languages
   'org-babel-load-languages
   '((C . t)))

  :hook
  (org-mode . visual-line-mode)
  (org-mode . (lambda ()
                (setq visual-fill-column-center-text t)
                (setq fill-column 140)
                (display-line-numbers-mode 0))))
#+end_src

** Org Modern
#+begin_src emacs-lisp
(use-package org-modern
  :after org

  :custom
  (org-modern-block-indent t)
  (org-modern-hide-stars nil)

  (org-modern-todo-faces
   '(("STARTED" :foreground "yellow")
     ("CANCELED" org-special-keyword
      :inverse-video t
      :weight bold)))

  (org-modern-list
   '((?* . "•")
     (?+ . "‣")))

  (org-modern-checkbox
   '((?X . "✔")
     (?- . "┅")
     (?\s . " ")))

  (org-modern-label-border 1)

  :hook
  (org-mode . org-modern-mode)
  (org-agenda-finalize . org-modern-agenda))
#+end_src

** Org Roam
#+begin_src emacs-lisp
(use-package org-roam
  :after org
  :custom
  (org-roam-v2-ack t))
#+end_src

** Export
#+begin_src emacs-lisp
(use-package ox-gfm
  :after org)
#+end_src
** end
#+begin_src emacs-lisp
  (provide 'orgconf)
#+end_src
