.config/emacs/lisp/prog.el

(use-package corfu
  :custom
  (corfu-auto nil)
  (corfu-auto-prefix 1)
  (corfu-auto-delay 0.0)
  (corfu-preview-current nil)
  (corfu-on-exact-match nil)

  :init
  (global-corfu-mode)

  :bind
  (:map corfu-map
        ("<tab>" . corfu-insert))

  :config
  (defun my/corfu-refresh ()
    (interactive)
    (when (bound-and-true-p corfu--frame)
      (corfu-quit))
    (completion-at-point)))

(use-package cape
  :init
  ;; Always request fresh completions from Eglot.
  (advice-add
   'eglot-completion-at-point
   :around
   #'cape-wrap-buster)

  ;; Additional completion source.
  (add-hook
   'completion-at-point-functions
   #'cape-file
   t))

(use-package nova
  :ensure
  (:host github
   :repo "thisisran/nova")
  :defer t)

 ;; (use-package treesit-auto
 ;;   :hook
 ;;   (after-init . global-treesit-auto-mode))

 ; apparently this is enough for emacs 31?
 (setq treesit-enabled-modes t)
;; (setq treesit-auto-install-grammar 'prompt)

(use-package eglot
  :defer t

  :custom
  (eglot-send-changes-idle-time 0.0)
  (eglot-ignored-server-capabilities
   '(:documentOnTypeFormattingProvider
     :inlayHintProvider
     :documentHighlightProvider))

  ;; :hook
  ;; ((c-mode
  ;;   c++-mode
  ;;   c-ts-mode
  ;;   c++-ts-mode
  ;;   kotlin-ts-mode)
  ;;  . eglot-ensure)

  :config
  (add-to-list
   'eglot-server-programs
   '((c-mode c++-mode c-ts-mode c++-ts-mode)
     . ("clangd"
        "--completion-style=detailed"
        "--header-insertion=never"
        "--limit-results=0")))

  (add-to-list
   'eglot-server-programs
   '(kotlin-ts-mode . ("kotlin-language-server")))

  :bind
  (:map eglot-mode-map
        ("C-c e a" . eglot-code-actions)
        ("C-c e r" . eglot-rename)
        ("C-c e f" . eglot-format)

        ("C-c e d" . xref-find-definitions)
        ("C-c e i" . eglot-find-implementation)
        ("C-c e t" . eglot-find-typeDefinition)
        ("C-c e u" . xref-find-references)

        ("C-c e h" . eldoc)
        ("C-c e s" . consult-eglot-symbols)

        ("C-c e l" . eglot-list-connections)
        ("C-c e q" . eglot-shutdown)
        ("C-c e R" . eglot-reconnect)))
(use-package consult-eglot
  :after eglot)

(use-package dape
  :ensure
  (:host github
   :repo "svaante/dape")

  :commands
  (dape
   dape-repl
   dape-breakpoint-toggle)

  :custom
  (dape-buffer-window-arrangement 'right)

  :config
  (dape-breakpoint-global-mode))

(provide 'prog)
